{
  "header": {
    "sections": [{
        "title": "Introduction",
        "header": "Welcome to the Listen page!",
        "content": "<p>Welcome to the <b>Listen</b> page! This page is now mainly for <b>managing your playlists</b> (also I realised only much later I should have probably named this page 'Playlists' but I'm committed so oh well).</br></br>In this page, there's a whole bunch of features for you to create and manage your playlists, so that your favourite songs from various years can be played together seamlessly and smoothly. The playlists will be stored locally on your computer, but fret not! You'll be able to get a code that you can share across devices using the import feature!</br></br>I've removed the functionality of playing a song from this page. Instead, once you have updated your playlists, the website's player automatically updates as well! To play your playlist, you can open up the interface at the bottom right of your screen! If you require any assistance, feel free to click on any of the links above to explain how to use the system!</br></br> TIP: You can also close this header by pressing on the top row of buttons!</p>"
      },
      {
        "title": "Features",
        "header": "Features",
        "content": "<p>This part of the page will sound like an advertisement, but I guess I'm trying to sell the features to you so just assume it is :) </br></br> The 'Listen' portion of the website has the following features:</p></br><h5>Playlist management</h5><p>Craft your own playlist using the songs available on the website, allowing you to create the Symphony of Voices you never thought you could possibly get! This includes addition and deletion of an unlimited number of playlists, and the addition or deletion of any songs in the archive!</p></br><h5>Custom titles and descriptions</h5><p>Change your titles and descriptions to whatever you want, simply by clicking on them! Customisability here is not an issue!</p></br><h5>Drag and drop arrangement of songs</h5><p>A playlist isn't in an order you want? Fret not! Dragging the song you want to the position in the list you want will automatically save it to your local storage, and you can customise which song order you want!</p></br><h5>Sharing playlists</h5><p>Sharing is caring, so I've added the ability to share with your friends and family your own handcrafted playlists, or even across your own devices via a code!</p>"
      },
      {
        "title": "Tutorial",
        "header": "Tutorial",
        "content": "<p>This page will guide you through the process of how to create your own playlist.</p></br><h5>Step 1: Creating a new playlist</h5><p>Before you begin choosing what songs you want, you need to create a new playlist. To do so, simply click on the '+ Create Playlist' button, and a new playlist will be generated and added to your list of playlists.</p></br><h5>Step 2: Changing the name / description</h5><p>To change the name and the description of the playlist, you simply click on them and a text box for you to edit the information will pop up. On a computer, hovering over it will make an outline of the box and allow you to edit once you click on it. The website automatically saves any changes you have made.</p></br><h5>Step 3: Adding a song</h5><p>To add a song to the playlist, scroll down to the 'Default Playlists' of the 'Listen' page. These playlists will not be editable. After finding a song you want, you can click on the '+' button to the left, and select the playlist you want to add your song to.</p></br><h5>Step 4: Deleting a song</h5><p>Let's assume that you've mistakenly added a song to your playlist. You can remove this song easily by clicking the 'x' next to the song under your playlist. This will remove it from the playlist and save your changes.</p></br><h5>Step 5: Arranging songs in your playlist</h5><p>Assume that you don't like the order of the songs you've added to the playlist. To arrange them, simply click and hold, and drag them to the desired position to order them. Once again, the website will automatically save any changes you've made to the playlist!</p></br><h5>Step 6: Deleting a playlist</h5><p>Let's say you've messed up and made a playlist that you don't really want. To remove one, simply expand the playlist by clicking on it, and click the cross at the top right. A pop-up will appear to confirm the deletion, and it will delete the playlist for you once you have confirmed.</p></br><h5>Step 7: Sharing a playlist</h5><p>If you'd like to share a playlist with someone or to yourself, click on the relevant playlist and click the code icon <i class=\"my-auto fas fa-code\"></i>. This will copy the code to your clipboard. Send this code to whoever you'd like to share it with, and they can import the playlist via the code with the 'Import' button at 'Your Playlists'!"
      },
      {
        "title": "Settings",
        "header": "",
        "content": ""
      }
    ]
  }
}