[
  {
    "title": "v4.1",
    "date": "09 August 2021",
    "summary": "This update mainly updates information regarding the various batches and adds a few SOVs. It also fixes some bugs inherent in the website.",
    "items": [{
        "title": "Add batch information for batches of 2020/2021 and 2021/2022",
        "explanation": ""
      },
      {
        "title": "Add songs and playlist information for SOV2007 and SOV2008",
        "explanation": "<ul><li><p>Users are able to navigate through SOVs of 2007 and 2008, adding them to their respective playlists if they desire</p></li></ul>"
      },
      {
        "title": "Fix bugs in the website",
        "explanation": ""
      }
    ]
  },
  {
    "title": "v4",
    "date": "",
    "summary": "This update is big enough to warrant it a new version code: v4. The main change is that I've converted the website and all its features into Angular (from pure HTML / CSS), and made it more integrated with Bootstrap 4. This helps to add a lot of functionality, and also helps to make the website more easily updatable in the future. The code is also much cleaner and more modifiable to add on new components / remove old components, and debug.",
    "items": [
      {
        "title": "Converted most / all of the code into Angular",
        "explanation": ""
      },
      {
        "title": "Added the website's player",
        "explanation": "<ul><li><p>Player allows you to play songs from SOVs throughout the website</p></li><li><p>Player can be minimised and expanded from bottom of website</p></li><li><p>Player reads custom created playlists</p></li></ul>"
      },
      {
        "title": "Revamped 'Listen' page",
        "explanation": "<ul><li><p>Page is no longer for playing music, instead is for managing playlists</p></li><li><p>Added custom playlists and customisation features</p></li><li><p>Added sharing of playlists via links</p></li><li><p>Added tutorials to guide user through playlist creation</p></li><li><p>Added small toast notifcations to inform user of any actions</p></li><li><p>Added settings page for Listen</p></li></ul>"
      },
      {
        "title": "Revamped 'Symphony of Voices' pages",
        "explanation": "<ul><li><p>Freshened up the page so that it's cleaner and looks better organised</p></li><li><p>Changed the styling of the repertoire</p></li><li><p>Added 'click to play' functionality for the songs: clicking on the songs now plays the song in the Player</p></li><li><p>Removed the YouTube embedded video: this was causing some page load errors which was irritating so I removed it</p></li></ul>"
      },
      {
        "title": "Revamped 'Contribution' page",
        "explanation": "<ul><li><p>Added new descriptions and specific roles I'm looking for</p></li><li><p>Added a form for users to fill up for feedback / ideas</p></li></ul>"
      },
      {
        "title": "Changed navigation stuff",
        "explanation": "<p>Users should not have any issues linking directly to individual pages now. Pressing the back button should also lead you to the correct pages.</p>"
      },
      {
        "title": "Cleaned up data storage",
        "explanation": "<p>The storing of the website's data (in JSON format) was pretty messy and has been cleaned up now. Added a form for users to fill up for feedback / ideas</p>"
      }
    ]
  },
  {
    "title": "New Year Cleaning",
    "date": "6 January 2020 ",
    "summary": "",
    "items": [
      {
        "title": "Updated the dates to 2020",
        "explanation": ""
      },
      {
        "title": "Added a \"Featured Photos\" segment to the batch pages",
        "explanation": ""
      },
      {
        "title": "Added photos for the 2014/2015 batch and the 2019/2020 batch",
        "explanation": ""
      },
      {
        "title": "Changed the intro on the main page",
        "explanation": ""
      }
    ]
  },
  {
    "title": "Mini mini update",
    "date": "29 August 2019",
    "summary": "",
    "items": [
      {
        "title": "Added the Batch of 2019 - 2020's information",
        "explanation": ""
      },
      {
        "title": "(Hopefully) Fixed a bug with the image in the footer of the website",
        "explanation": ""
      }
    ]
  },
  {
    "title": "For the night is dark and full of terrors",
    "date": "1 June 2019",
    "summary": "",
    "items": [
      {
        "title": "Added SOV2010's information (available on both the SOV page and listen page)",
        "explanation": ""
      },
      {
        "title": "Added a \"night mode\" to the website - you can toggle this on and off on the sidebar)",
        "explanation": ""
      },
      {
        "title": "Reuploaded SOV2014's data - previously the quality was quite crappy but I've re-cut and reuploaded it so that it's more pleasant to listen to",
        "explanation": ""
      },
      {
        "title": "Listen loading animation (not sure if this 100% works, but what it's supposed to do is show a loading animation when the track hasn't loaded, and it'll disappear when it has)",
        "explanation": ""
      },
      {
        "title": "Some text fixes (song names, song composers etc.)",
        "explanation": ""
      }
    ]
  },
  {
    "title": "SOV2019 Update",
    "date": "28 May 2019",
    "summary": "",
    "items": [
      {
        "title": "Added SOV2019's information (which includes download links, updates to the listen page)",
        "explanation": ""
      },
      {
        "title": "Re-coded the website to make it more developer friendly (this is stuff you don't need to care about",
        "explanation": ""
      },
      {
        "title": "Reorganised information on the website (it was getting a bit too cluttered with different batches and SOVs, so I've put them on one landing page and you can access the rest from there)",
        "explanation": ""
      },
      {
        "title": "Added a Contribution page, which includes detailed information on how to contribute without actually doing any of the coding stuff (leave that to us!)",
        "explanation": ""
      },
      {
        "title": "Removed the Stories page - I have an idea of how to improve it but I don't have the time to code it out right now, and it kind of broke when I was updating the site so it'll be gone for a bit.",
        "explanation": ""
      },
      {
        "title": "Redid the Listen page - now acts like a budget Spotify player with shuffle features and a Favourites playlist.",
        "explanation": ""
      },
      {
        "title": "Remastered audio for SOV2012 and SOV2014 - previously these pieces of audio were quite trashy in quality but thanks to Mr Samuel Wong I have proper recordings of these SOVs now. The audio is much cleaner and nicer to listen to.",
        "explanation": ""
      },
      {
        "title": "Redid the album art for SOV2012 and SOV2014",
        "explanation": ""
      }
    ]
  },

  {
    "title": "This is still alive!",
    "date": "03 Mar 2019",
    "summary": "",
    "items": [
      {
        "title": "Added a bunch of stories that were submitted last year apparently but I never realised (sorry Dayne)",
        "explanation": ""
      },
      {
        "title": "Added a small countdown to SOV2019 at the bottom of this page",
        "explanation": ""
      },
      {
        "title": "Changed the website font and standardised it (I hated the previous one)",
        "explanation": ""
      },
      {
        "title": "Removed our Christmas logo (bet you didn't even realise we had one)",
        "explanation": ""
      },
      {
        "title": "Updated SOV (there was one song that couldn't play, Die mit, which should be fixed now)",
        "explanation": ""
      },
      {
        "title": "Various other minimal aesthetic changes that should make the website more enjoyable",
        "explanation": ""
      }
    ]
  },

  {
    "title": "Never too late to the party!",
    "date": "11 Dec 2018",
    "summary": "",
    "items": [
      {
        "title": "Added SOV2012 (information and Listen data)",
        "explanation": ""
      },
      {
        "title": "Added 2018/2019 batch information (thanks Sih-Zau!)",
        "explanation": ""
      },
      {
        "title": "You can now listen to SOV2012 under the 'Listen' section! (thanks to Trixie for sending in the recordings)",
        "explanation": ""
      }
    ]
  },

  {
    "title": "v3",
    "date": "03 Dec 2018",
    "summary": "",
    "items": [
      {
        "title": "The website has been updated to give it a fresher, modern look!",
        "explanation": ""
      },
      {
        "title": "Added proper sections for each item, with relevant information under each item.",
        "explanation": ""
      }
    ]
  }
]
