{
    "help": "<div class=\"modal-header\"><h2>Welcome to the Listen page!</h2><span class=\"close\"><i class=\"material-icons\">close</i></span></div><p>This page allows you to peruse through the previous batches' SOVs without the hassle of downloading the tracks and putting it on your phones. Think of it as a budget Spotify.</br></br>The page will use data to stream the music from GitHub to your device. As such, please monitor your data usage because it can get pretty excessive if you're on mobile data.</br></br>If you're confused on how to use this, just click around and you should be able to figure it out. If not, you can click on the \"How to use\" button for more information on how to use this page. If you manage to find any bugs or spot any mistakes, please don't hesitate to contact us so that we can fix the issue ASAP.</br></br>Thanks for looking through the website, and enjoy making your own playlists / browsing through VJChoir's extensive repertoire :)</p>",
    "how": "<div class=\"modal-header\"><h2>How to use</h2><span class=\"close\"><i class=\"material-icons\">close</i></span></div><p><b>Basic stuff:</b></br>The player at the top is pretty simple, you have your play, stop and pause buttons, a volume control, a music \"seeker\" that allows you to select which part of the song to play, and a shuffle button. The shuffle button will shuffle the playlist that you've selected and play the songs in a random order.</br></br><b>Favourites:</b></br>The \"Favourites\" playlist at the top of the page is meant for you to customise; you can add songs from different SOVs into that playlist and it will be saved on your device. When you load up this page again it automatically loads the playlist you've saved.</br></br><b>Problems with favourites playlist:</b></br>We can't guarantee that the features in the page will work perfectly, so there is a \"Reset settings\" button for you to reset the favourites playlist if any issues arise with it. Clicking it will remove all the songs you've saved in the playlist (may need to refresh to see the effects).</p>",
    "reset": "<div class=\"modal-header\"><h2>Reset settings</h2><span class=\"close\"><i class=\"material-icons\">close</i></span></div><p>Resetting settings will cause your favourite playlist to be wiped. You should generally do this when an error has been encountered while tinkering with favourites playlist. Do you want to continue?</p><button id=\"listen-reset\"class=\"nav-button\">Reset everything!</button>"
}