[
    {
        "title": "The Archival Project",
        "id": "archival",
        "img": "/assets/images/about.jpg",
        "text": "I started this project back in 2014 when I was bored and studying for 'A' Levels. A lot of the free time I had during that period was spent on making the first iteration of the website (which was one based off Google Sites, it looked quite terrible but it got the job done). I used to study a lot in the choir room and I'd browse through all the abandoned documents below the lockers and I'd think to myself why not just store it online.</br></br>So I did, and came the first iteration of the website. It wasn't just like old photos and documents or whatever though, I wanted to be able to look back at my own SOV in the future and enjoy it once again, so I decided to do it for videos, and it extended to audio as well. Making all the album art, cutting up audio and videos etc. may seem pretty boring to some but for me it was quite enjoyable.</br></br>It's my hope that this project will help you bring back fond memories of your time in VJChoir. The friends I made in choir have become what I believe will be my lifelong friends, and you may not have the same idea about those in your batch, but in the end the music you guys produced is something precious and should be kept well and shared. Hopefully this website, and my YouTube account jumpcutfindo can help you relive some of those memories, of a time simpler than probably what is currently. Thanks for reading, and enjoy.</br></br> PS. The project is mainly being managed by me (<b>@themeef</b> / <b>jumpcutfindo</b>), so if you do want to contribute you're completely welcome to. The main struggle with this website is finding the content and I would really appreciate it if you dropped me an email or submitted suggestions to me (you can email me at <b>hoe.chan.wei.2014@vjc.sg</b> OR <b>danielhoe97@gmail.com</b>)."
    },

    {
        "title": "The Choir",
        "id": "choir",
        "img": "/assets/images/header1.jpg",
        "text": "(Essentially copypasted from booklets) </br></br>Under the guidance of esteemed choral director, Professor Nelson Kwei, Victoria Junior College Choir has grown from strength since its humble beginnings in 1985. The Victoria Junior College Choir has become one of the most celebrated Singaporean school-based choirs in the international scene and now boasts a comprehensive repertoire of choral pieces, ranging from majestic sacred pieces to dynamic folklore pieces from all over the world. The VJC Choir you see today is undoubtedly the product of the blood, sweat and tears of its members, both past and present. </br></br>Not only was the choir the first in Singapore to win the Olympic World Choir Games Championship title - the most prestigious international choral award, it was also the first Asian choir to win both the esteemed Audience Priza and Grand Prix Award in the 9th Riva Del Garda International Choral Competition held in 2006. In the Venezia in Musica 2010 International Choir Competition and Festival held by the international choral body, Musica-Mundi Interkultur, the choir emerged as first in the competition series, receiving the Diploma of Honour for furthest achievement, and was also the highest scorer for the entire competition with 3 high gold awards.</br></br>Last year, the Choir was awarded the Certificate of Distinction in the 2013 Singapore Youth Festival (SYF) Arts Presentation. The choir also clinched Category Champions and the prestigious title of Chanson de Voyager in the 2013 Voyage of Songs International Choral Festival. Currently, Victoria Junior College Choir is ranked 7th for Mixed Choirs and 7th for Male Choirs, by the INTERKULTUR World Rankings.</br></br>'No Man is An Island' - the choir's anthem, is a legacy passed down over the years, which conveys our heartfelt love towards both music and our fellow choir members. Indeed, a choir like Victoria Junior College's is formed with the combined efforts of everyone. Under the tutelage of our resident conductor Professor Nelson Kwei, and with the sacrifices made by every choir member, VJC Choir continues to pursue excellence in choral singing both locally and abroad to ensure that the flame of our legacy will continue to burn bright."
    },

    {
        "title": "Our Conductor",
        "id": "conductor",
        "img": "/assets/images/mrkweiheadshot.jpg",
        "text": "(Also essentially copypasted from booklets)</br></br>Professor Nelson Kwei, the Principal of Singapore Raffles Music College, is an accomplished conductor, conservatorium lecturer, editorial advisor, music arranger and vocal tutor in the music scene. He is a Fellow from the London College of Music, has a Licentiate in singing from the Guildhall School of Music and an Advance Post-Graduate in Choral Conducting from the Royal Academy of Music (London).</br></br>In 1993, Professor Kwei was honoured with the \"National Youth Service Award\", the highest Youth Award in Singapore, in recognition of his significant contribution in the field of choral art. In 1999, he was awarded with the \"Culture Award\" by the Japanese Chamber of Commerce and Industry and in 2001, the Rotary Club honoured him as the \"Ambassador of the Arts\" for Singapore.</br></br>On the international level, Professor Nelson Kwei won the prestigious \"Outstanding Choral Director Award\" at the International Choral Competition in Germany, 1998 & 1999 and in Prague, 2002 & 2004. In recent years, he has led his choirs to 8 Gold Medals including 3 Choir Olympic Champions in the World Choir Games held in Bremen, Germany & Xiamen, China. His choir was also the first Asian choir to win the Grand Prize & Audience Prize at the prestigious Concorso Corale Internazionale held in Riva Del Garda, Italy. In 2008, he was also conferred the \"Conductor Prize\" in the recent 10th edition of the internationally-acclaimed choral competition.</br></br>Presently, he is an executive member of the National Arts Council's Advisory Board for Choral Development in Singapore, the Honorary Chairman of the Choral Directors' Association(Singapore) and the President of the Singapore Federation for Choirs & Conductors, as well as the Artistic Director of \"A Voyage of Songs\" and \"Concentus Orientale\", both of which are prominent international choral competitions. Professor Nelson Kwei is also invited as both clinician and adjudicator in many top international choral festivals and competitions including the World Choir Games Series. Currently, he is the Conductor of many prestigious schools, university and semi-professional choirs in Singapore that has won numerous national and international accolades."
    },

    {
        "title": "Contributors",
        "id": "contributors",
        "img": "",
        "text": "<ul> <li>Batch of 2014 - 2015</li><p>These guys were my batch, and even though there were many ups and downs up until now I can safely saythey're my greatest takeaways from my time in VJ. Without them, there wouldn't be this website, there wouldn't be a jumpcutfindo, and I'd be a much different person than I am now.</p><li>2013 - 2014</li><p>Xing Yun + the Chaps, various other seniors from Alto and Bass</p><li>2015 - 2016<p>Allysia, Vera, Zhi Xin, Emanuel, Donavan, Gerald, and a few others</p></li><li>2016 - 2017<p>Michelle and Ye Won</p></li><li>2017 - 2018<p>Dayne (for contributing her batch's information)</p></li><li>2018 - 2019<p>Sih-Zau (for contributing her batch's information)</p></li><p>I can't really list everyone I'd like to so if you're not here and it matters, you can always tell me. Thanks to those who have helpedshape who I am today and who helped to make this project what it is today as well.</p></ul>"
    }
]